[{"id": 1, "word": "inexorable", "list_definition": "impossible to prevent, resist, or stop", "verbose_definition": "When a person is inexorable, they're stubborn. When a thing or process is inexorable, it can't be stopped."}, {"id": 2, "word": "entrench", "list_definition": "fix firmly or securely", "verbose_definition": "To entrench is to secure something firmly. Entrench a tent pole in the ground so your tent doesn't fly away, or entrench yourself at your new job so you don’t get fired."}, {"id": 3, "word": "meticulous", "list_definition": "marked by precise accordance with details", "list_description": "\"Detail oriented\" and \"perfectionist\" are other ways of describing someone who cares deeply about the small things and about getting things exactly right, every time", "verbose_definition": "Someone who is meticulous pays extreme attention to detail. If that person is, say, your surgeon or your accountant, you'll definitely want them to be meticulous!"}, {"id": 4, "word": "impudent", "list_definition": "improperly forward or bold", "verbose_definition": "An impudent person is bold, sassy, and shameless. If your teacher asks the class to open their textbooks, and you snap back, \"Let's not and say we did,\" you're being impudent."}, {"id": 5, "word": "deferential", "list_definition": "showing courteous regard for people's feelings", "list_description": "To be obedient, courteous, or dutiful are all ways of being deferential. Bowing low to the Queen is a deferential act when visiting Buckingham Palace\n Being deferential shows respect, but also means \"I know my place, and it's lower than yours.\"", "verbose_definition": "When a young person shows respect and obedience to an older person, they’re being deferential to the elder’s wisdom and experience."}, {"id": 6, "word": "dictatorial", "list_definition": "characteristic of an absolute ruler or absolute rule"}, {"id": 7, "word": "predilection", "list_definition": "a predisposition in favor of something", "verbose_definition": "A predilection is a preference for or bias toward something. If you have a predilection for wool clothing, you should take up knitting."}, {"id": 8, "word": "culpability", "list_definition": "a state of guilt", "verbose_definition": "Culpability is a state of guilt or responsibility. A lot of lawsuits are about who has culpability for something that went wrong."}, {"id": 9, "word": "apathetic", "list_definition": "showing little or no emotion or animation", "verbose_definition": "Apathetic is an adjective that describes the feeling of being bored with what’s going on around you.  If you don’t care one way or another, you’re apathetic."}, {"id": 10, "word": "querulous", "list_definition": "habitually complaining", "list_description": "Synonyms : whiny, fretful", "verbose_definition": "Querulous means “having a tendency to complain” or, more directly put, “whiny.” Sure, no one can be happy all the time, but that’s no excuse for being querulous."}, {"id": 11, "word": "fortuitous", "list_definition": "lucky; occurring by happy chance", "verbose_definition": "Fortuitous means by chance, like a lucky accident. If you and your best friend's families happen to go on vacation to the same place at the same time, that’s a fortuitous coincidence!"}, {"id": 12, "word": "prescience", "list_definition": "the power to foresee the future", "verbose_definition": "Do you already know what happens tomorrow? Next week? Next year? If you can see into the future, then you have prescience."}, {"id": 13, "word": "didactic", "list_definition": "instructive, especially excessively", "list_description": "Didi - Always trying to be instuctive", "verbose_definition": "When people are didactic, they're teaching or instructing. This word is often used negatively for when someone is acting too much like a teacher."}, {"id": 14, "word": "superfluous", "list_definition": "more than is needed, desired, or required", "verbose_definition": "When something is so unnecessary that it could easily be done away with, like a fifth wheel on a car or a fifth person on a double date, call it superfluous."}, {"id": 15, "word": "frivolous", "list_definition": "not serious in content, attitude, or behavior", "list_description": "The word is often used to describe lawsuits. A frivolous lawsuit has no value and will be a waste of the court's time, like someone suing McDonald's for making the coffee too hot (which actually happened)", "verbose_definition": "Frivolous things are silly or unnecessary. If something is frivolous, then you don't need it."}, {"id": 16, "word": "reticent", "list_definition": "reluctant to draw attention to yourself", "verbose_definition": "Reticent means either quiet or restrained. If you're reticent about your feelings, you like to keep them to yourself, and you're probably quiet in rowdy groups where everyone is talking over each other."}, {"id": 17, "word": "decorous", "list_definition": "characterized by propriety and dignity and good taste", "verbose_definition": "Something that is decorous is dignified, proper, and in good taste, like your decorous great-aunt who always wears a dress — even when she's only headed to the grocery store."}, {"id": 18, "word": "conspicuous", "list_definition": "obvious to the eye or mind", "list_description": "Conspicuous can mean either very obvious to the eye (like something that is conspicuous from a distance) or attracting attention (like conspicuous consumption)", "verbose_definition": "Keep your eye on the adjective conspicuous for something that stands out so much you notice it right away — like that zit in the center of your friend's forehead."}, {"id": 19, "word": "mawkish", "list_definition": "effusively or insincerely emotional", "list_description": "\"Maa\" ka \"kiss\" hamesha sentimental aur emotional hota hai!", "verbose_definition": "Mawkish means excessively sentimental or so sappy it's sickening. Which is how you'd describe two lovebirds gushing over each other or your grandma’s cooing, cheek pinches, and sloppy-lipstick kisses."}, {"id": 20, "word": "chortle", "list_definition": "a soft partly suppressed laugh", "verbose_definition": "A chortle is a joyful, partly muffled laugh. If you have a toddler, you will recognize the sound of a delighted chortle, sort of louder and a bit more raucous than a giggle."}, {"id": 21, "word": "eschew", "list_definition": "avoid and stay away from deliberately", "list_description": "A dieter might eschew a chocolate sundae, not because he doesn’t like it, but because he’s afraid of what it will do to his waistline\n\n shun, avoid\n\n Synonym : Shun, dread", "verbose_definition": "If you eschew something, you deliberately avoid it. If you live the bohemian life in the city, then most likely you eschew the suburbs."}, {"id": 22, "word": "gainsay", "list_definition": "take exception to", "list_description": "A(gain)st-(say) : say against", "verbose_definition": "Gainsay, a verb, means \"contradict\" or \"speak out against.\" When you challenge authority, you gainsay, as in teachers don't like it when unruly students gainsay them."}, {"id": 23, "word": "voluble", "list_definition": "marked by a ready flow of speech", "verbose_definition": "Voluble describes someone who talks a lot, like your aunt who can’t stop telling you to cut your hair or a political candidate who makes twenty speeches on the day before the election."}, {"id": 24, "word": "platitude", "list_definition": "a trite or obvious remark", "verbose_definition": "If an executive gives a speech that begins, \"This business is all about survival of the fittest. You need to burn the midnight oil and take one for the team,\" his employees might get sick of listening to these meaningless clichés and tell him to cut the platitudes."}, {"id": 25, "word": "culminate", "list_definition": "end, especially to reach a final or climactic stage", "verbose_definition": "The verb culminate is used to describe a high point or a climactic stage in a process. For example, the goal of a Major League baseball team is to have their season culminate in a World Series victory."}, {"id": 26, "word": "audacious", "list_definition": "disposed to venture or take risks", "verbose_definition": "This adjective is very bold — if you are audacious, you are daring and unconventional!"}, {"id": 27, "word": "concede", "list_definition": "give over", "list_description": "give over, surrender\n\n acknowledge", "verbose_definition": "If you concede something, you admit that it is true, proper, or certain — usually in an unwilling way and often in the context of a competition, as in \"At midnight, the candidate finally conceded defeat.\""}, {"id": 28, "word": "recondite", "list_definition": "difficult to understand", "list_description": "\"abstruse,\" \"esoteric\" and \"totally deep, man\"", "verbose_definition": "It's rather difficult to penetrate the meaning of recondite. Fitting, because it's an adjective that basically means hard for the average mind to understand."}, {"id": 29, "word": "torpor", "list_definition": "a state of motor and mental inactivity", "list_description": "tor-por....TORRENT PAR..........TORRENT PAR most of the seeders were INACTIVE due to which downloading the movie becomes a SLUGGISH task....", "verbose_definition": "Torpor is a state of mental and physical inactivity. \"After a huge Thanksgiving meal, my family members fall into a torpor; no one can even pick up the TV remote.\""}, {"id": 30, "word": "bucolic", "list_definition": "devoted to raising sheep or cattle", "list_description": "Used as an adjective, bucolic can refer to an idealized rural life (think life with cows) or to herdsmen (more cows)", "verbose_definition": "As an adjective, bucolic refers to an ideal country life that many yearn for. If your parents wanted to raise you in a bucolic environment, you may find yourself living 45 minutes away from the nearest movie theater or person your age. Not ideal."}, {"id": 31, "word": "cryptic", "list_definition": "having a secret or hidden meaning", "verbose_definition": "\"White bunny. Moon square.\" Do you understand what that means? Of course not! It's totally cryptic. Cryptic comments or messages are hard to understand because they seem to have a hidden meaning."}, {"id": 32, "word": "diffident", "list_definition": "showing modest reserve", "list_description": "diffident = difficult to be confident", "verbose_definition": "The adjective diffident describes someone who is shy and lacking in self-confidence. If you are shy and have a diffident manner, you should probably not choose one of these professions: substitute teacher, stand-up comic, or lion-tamer."}, {"id": 33, "word": "incisive", "list_definition": "demonstrating ability to recognize or draw fine distinctions", "list_description": "something that is sharp, decisive, and direct", "verbose_definition": "The adjective incisive describes something that is sharp, decisive, and direct. A comment that cuts right to the bone can be just as incisive as an actual knife."}, {"id": 34, "word": "mitigate", "list_definition": "lessen or to try to lessen the seriousness or extent of", "list_description": "mītis \"soft\" and agere \"to do/act,\" which add up to \"to soften.\"", "verbose_definition": "Choose the verb mitigate when something lessens the unpleasantness of a situation. You can mitigate your parents' anger by telling them you were late to dinner because you were helping your elderly neighbor."}, {"id": 35, "word": "perfidy", "list_definition": "an act of deliberate betrayal", "list_description": "per+ fidy=without fidelity i.e cheat upon ur partner,,in general cheat or breach something", "verbose_definition": "If you shared your most embarrassing secrets with a friend who then told them to everyone he knows, his betrayal could be described as perfidy."}, {"id": 36, "word": "glut", "list_definition": "supply with an excess of", "verbose_definition": "A glut is too much of something. A glut of gas in the marketplace can lower its price. A glut of heavy metal T-shirts in your dresser, however, has nothing to do with the economy but might be a signal that it's time to clean your room."}, {"id": 37, "word": "banal", "list_definition": "repeated too often; overfamiliar through overuse", "verbose_definition": "If something is boring and unoriginal, it's banal. Banal things are dull as dishwater."}, {"id": 38, "word": "rustic", "list_definition": "characteristic of rural life", "verbose_definition": "When you think of the word rustic, think of the rural country. This word can be given a positive or a negative spin depending on how you use it; a rustic inn, for example, might be quaint or it might be virtually uninhabitable."}, {"id": 39, "word": "preclude", "list_definition": "make impossible, especially beforehand", "verbose_definition": "To preclude something is to prevent it from happening. A muzzle precludes a dog from biting."}, {"id": 40, "word": "gossamer", "list_definition": "a gauze fabric with an extremely fine texture", "list_description": "syn : diaphanous, delicate, gauzy, sheer\n\n GO+SAMMER(summer) - we wear clothes of light fabric", "verbose_definition": "Gossamer is something super fine and delicate — like a spider web or the material of a wedding veil."}, {"id": 41, "word": "germane", "list_definition": "relevant and appropriate", "list_description": "Ger(main) : he asked the \"main\" (appropriate) question", "verbose_definition": "Germane means relevant; it fits in. If you are giving a speech on dog training, stick to the germane, canine stuff. Topics that would not be germane? Catnip toys, hamster wheels, and the use of a saddle."}, {"id": 42, "word": "vociferous", "list_definition": "conspicuously and offensively loud", "verbose_definition": "Vociferous describes loudmouths, such as the vociferous mob at the soccer game."}, {"id": 43, "word": "engender", "list_definition": "call forth", "list_description": "fancy way of saying \"to make something\"", "verbose_definition": "Engender is a fancy way of saying \"to make happen,\" like when you engender the spirit of teamwork and cooperation by encouraging others and doing your share of the group's work."}, {"id": 44, "word": "aesthetic", "list_definition": "characterized by an appreciation of beauty or good taste", "verbose_definition": "The adjective aesthetic comes in handy when the subject at hand is beauty or the arts. A velvet painting of dogs playing poker might have minimal aesthetic appeal."}, {"id": 45, "word": "exacerbate", "list_definition": "make worse", "list_description": "formal worse", "verbose_definition": "For a formal-sounding verb that means to make worse, try exacerbate. If you're in trouble, complaining about it will only exacerbate the problem."}, {"id": 46, "word": "lambast", "list_definition": "censure severely or angrily", "list_description": "syn : chastise"}, {"id": 47, "word": "gall", "list_definition": "a digestive juice secreted by the liver", "list_description": "syn : impertient", "verbose_definition": "Gall describes something irritating, like someone very rude. If you barge into a bakery and cut in front of a sweet old lady, then you have gall."}, {"id": 48, "word": "dogmatic", "list_definition": "pertaining to a code of beliefs accepted as authoritative", "verbose_definition": "To be dogmatic is to follow a set of rules no matter what. The rules might be religious, philosophical, or made-up, but dogmatic people would never waver in their beliefs so don’t even think of trying to change their minds."}, {"id": 49, "word": "obscure", "list_definition": "not clearly understood or expressed", "verbose_definition": "If something is obscure, it's vague and hard to see. Be careful if you're driving in heavy rain — the painted lines can be obscure."}, {"id": 50, "word": "aesthete", "list_definition": "one who professes great sensitivity to the beauty of art", "verbose_definition": "Someone who claims to be concerned only with matters of art and beauty is known as an aesthete. Depending on the way he goes about it, he might also be known as a snob."}]