[{"id": 1, "word": "abate", "list_definition": "become less in amount or intensity", "verbose_definition": "Something that abates becomes fewer or less intense. Your enthusiasm for skiing might abate after falling off a ski lift and getting a mouthful of snow."}, {"id": 2, "word": "chicanery", "list_definition": "the use of tricks to deceive someone", "verbose_definition": "Have you ever gotten the sense that politicians or corporate leaders will say anything to turn public opinion their way? This tricky kind of deceit and manipulation is called chicanery."}, {"id": 3, "word": "disseminate", "list_definition": "cause to become widely known", "verbose_definition": "Disseminate means to spread information, knowledge, opinions widely. Semin- derives from the Latin word for seed; the idea with disseminate is that information travels like seeds sown by a farmer."}, {"id": 4, "word": "gainsay", "list_definition": "take exception to", "verbose_definition": "Gainsay, a verb, means \"contradict\" or \"speak out against.\" When you challenge authority, you gainsay, as in teachers don't like it when unruly students gainsay them."}, {"id": 5, "word": "latent", "list_definition": "potentially existing but not presently evident or realized", "verbose_definition": "Latent is an adjective that you use to describe something that is capable of becoming active or at hand, though it is not currently so."}, {"id": 6, "word": "aberrant", "list_definition": "markedly different from an accepted norm", "verbose_definition": "Use the adjective aberrant to describe unusual conduct. Sitting in a bathtub and singing show tunes all day long might be considered aberrant behavior."}, {"id": 7, "word": "coagulate", "list_definition": "change from a liquid to a thickened or solid state", "verbose_definition": "When liquid starts to thicken and become solid, it coagulates. When you get a cut, the blood flowing from the wound will coagulate: it will start to clot and form a solid scab so you will stop bleeding."}, {"id": 8, "word": "dissolution", "list_definition": "separation into component parts", "verbose_definition": "The dissolution of a relationship means that it's broken up or ended. The dissolution of your band means you better get started on your solo album."}, {"id": 9, "word": "garrulous", "list_definition": "full of trivial conversation", "verbose_definition": "A garrulous person just won’t stop talking (and talking, and talking, and talking...)."}, {"id": 10, "word": "laud", "list_definition": "praise, glorify, or honor", "verbose_definition": "To laud someone means to praise them extravagantly — usually in a very public manner. A music critic might laud a new song by calling it the best summer anthem ever created."}, {"id": 11, "word": "abeyance", "list_definition": "temporary cessation or suspension", "verbose_definition": "An abeyance is a temporary halt to something, with the emphasis on \"temporary.\" It is usually used with the word \"in\" or \"into\"; \"in abeyance\" suggests a state of waiting or holding."}, {"id": 12, "word": "coda", "list_definition": "the closing section of a musical composition", "verbose_definition": "A coda is a concluding segment of a piece of music, a dance, or a statement. It's usually short and adds a final embellishment beyond a natural ending point. Like this."}, {"id": 13, "word": "dissonance", "list_definition": "disagreeable sounds", "verbose_definition": "Disagreeable sounds can be called dissonance. You know it's dissonance if you have the strong desire to cover your ears with your hands."}, {"id": 14, "word": "goad", "list_definition": "stab or urge on as if with a pointed stick", "verbose_definition": "A goad is a pointy stick or other instrument used to prod something along. To goad is to poke something with that pointy stick. Either way, the pointiness is really essential for making things leap into action."}, {"id": 15, "word": "lethargic", "list_definition": "deficient in alertness or activity", "verbose_definition": "When you feel lethargic, you're sluggish or lacking energy. Being sleepy or hungry can make anyone lethargic."}, {"id": 16, "word": "abscond", "list_definition": "run away, often taking something or somebody along", "verbose_definition": "Abscond is to escape, often taking something along. As a kid, you may have absconded from your lemonade stand — with the coffee can of cash in hand, and your bewildered sister still filling cups for your customers."}, {"id": 17, "word": "cogent", "list_definition": "powerfully persuasive", "verbose_definition": "When you make a cogent argument, it means your argument is clear and persuasive. In these days of 24-hour entertainment news and sound-bite sized explanations of complex government policy, it’s hard to find a cogent argument amidst all the emotional outbursts."}, {"id": 18, "word": "distend", "list_definition": "cause to expand as if by internal pressure", "verbose_definition": "A soda and pizza binge might make your stomach distend, meaning your stomach will swell as a result of pressure from the inside."}, {"id": 19, "word": "gouge", "list_definition": "an impression in a surface, as made by a blow", "verbose_definition": "To gouge can mean to make a hole or dent in something, or to swindle or steal by overcharging. If your local gas station raises prices because a storm is coming, you may say that the station owner is gouging you — and that's illegal."}, {"id": 20, "word": "levee", "list_definition": "an embankment built to prevent a river from overflowing", "verbose_definition": "A levee is an embankment, like a dam, constructed to prevent the overflow of a body of water. It can also mean a formal reception. How do these two words relate? Read on..."}, {"id": 21, "word": "abstemious", "list_definition": "marked by temperance in indulgence", "verbose_definition": "Reserve abstemious for someone who exercises restraint, especially with regard to alcohol. A rock musician may sing about enjoying wine and women, but in his private life he may be abstemious."}, {"id": 22, "word": "commensurate", "list_definition": "corresponding in size or degree or extent", "verbose_definition": "The word commensurate has to do with things that are similar in size and therefore appropriate. Many people think the death penalty is a commensurate punishment for murder. In other words, the penalty fits the crime."}, {"id": 23, "word": "distill", "list_definition": "undergo condensation", "verbose_definition": "When you distill something, you are boiling it down to its essence — its most important part. Whether it's alcohol or ideas, the distilled part is the most powerful."}, {"id": 24, "word": "grandiloquent", "list_definition": "lofty in style", "verbose_definition": "Grandiloquent is a fancy term for, well, being fancy or pretentious. In fact, you might say grandiloquent is itself a pretty grandiloquent word."}, {"id": 25, "word": "levity", "list_definition": "a manner lacking seriousness", "verbose_definition": "Joking that your dead grandmother \"never looked better\" could inject some levity, or frivolity, into her funeral, but your relatives might find your joke inappropriate to the occasion."}, {"id": 26, "word": "admonish", "list_definition": "scold or reprimand; take to task", "verbose_definition": "To admonish is to scold. If you want to show someone you're not happy with his behavior, admonish him."}, {"id": 27, "word": "compendium", "list_definition": "a publication containing a variety of works", "verbose_definition": "When you search an online encyclopedia, you are searching a compendium of information on just about everything. A compendium is a comprehensive collection of something."}, {"id": 28, "word": "diverge", "list_definition": "move or draw apart", "verbose_definition": "When two roads diverge, they split and go in different directions. If your opinion diverges from mine, we do not agree. To diverge means to move apart or be separate."}, {"id": 29, "word": "gregarious", "list_definition": "temperamentally seeking and enjoying the company of others", "verbose_definition": "If you know someone who's outgoing, sociable, and fond of the company of others, you might want to call her gregarious."}, {"id": 30, "word": "log", "list_definition": "a segment of the trunk of a tree when stripped of branches", "verbose_definition": "A log is the trunk of a tree minus the branches: logging is cutting down trees. A log is also a written record of something, and logging is keeping such a record."}, {"id": 31, "word": "adulterate", "list_definition": "make impure by adding a foreign or inferior substance", "verbose_definition": "If you adulterate something, you mess it up. You may not want to adulterate the beauty of freshly fallen snow by shoveling it, but how else are you going to get to work?"}, {"id": 32, "word": "complaisant", "list_definition": "showing a cheerful willingness to do favors for others", "verbose_definition": "If only the world were populated entirely with complaisant people! Complaisant means willing to do something to please others, and complaisant people or animals are wonderful to be around."}, {"id": 33, "word": "divest", "list_definition": "take away possessions from someone", "verbose_definition": "It could be your wine portfolio, your stake in a mining company, or even the extra coats that are taking up space in your closet. Whatever it is, when you divest something, you get rid of it."}, {"id": 34, "word": "guileless", "list_definition": "innocent and free of deceit", "verbose_definition": "If you are guileless, you are not a liar; you are innocent, and you might be a touch on the gullible side."}, {"id": 35, "word": "loquacious", "list_definition": "full of trivial conversation", "verbose_definition": "A loquacious person talks a lot, often about stuff that only they think is interesting. You can also call them chatty or gabby, but either way, they're loquacious."}, {"id": 36, "word": "aesthetic", "list_definition": "characterized by an appreciation of beauty or good taste", "verbose_definition": "The adjective aesthetic comes in handy when the subject at hand is beauty or the arts. A velvet painting of dogs playing poker might have minimal aesthetic appeal."}, {"id": 37, "word": "compliant", "list_definition": "disposed to act in accordance with someone's wishes", "verbose_definition": "If you are willing to submit to someone's request, then you are compliant. Parents like it when their teenagers are compliant and follow the rules. Teenagers, on the other hand, are probably not as compliant as parents would like to think!"}, {"id": 38, "word": "document", "list_definition": "a representation of a person's thinking with symbolic marks", "verbose_definition": "A document is a piece of paper that contains official information. Don't you wish you had a document saying that the bank owed you $5 million?"}, {"id": 39, "word": "gullible", "list_definition": "naive and easily deceived or tricked", "verbose_definition": "If you are gullible, the joke is on you because you are easily fooled."}, {"id": 40, "word": "lucid", "list_definition": "transparently clear; easily understandable", "verbose_definition": "Something that's lucid is clear and understandable. Lucid writing is important in journalism, so that readers easily get the point of the article they're reading."}, {"id": 41, "word": "aggregate", "list_definition": "a sum total of many heterogeneous things taken together", "verbose_definition": "To aggregate is to collect many units into one. If you're writing a novel, you might create a character who is an aggregate of five or six real people."}, {"id": 42, "word": "conciliatory", "list_definition": "making or willing to make concessions", "verbose_definition": "If you're in a fight with a friend and you want to end it, you should make a conciliatory gesture, such as inviting her to a party you're having. Conciliatory describes things that make other people less angry."}, {"id": 43, "word": "dogmatic", "list_definition": "pertaining to a code of beliefs accepted as authoritative", "verbose_definition": "To be dogmatic is to follow a set of rules no matter what. The rules might be religious, philosophical, or made-up, but dogmatic people would never waver in their beliefs so don’t even think of trying to change their minds."}, {"id": 44, "word": "harangue", "list_definition": "a loud bombastic declamation expressed with strong emotion", "verbose_definition": "A harangue is more than a speech, louder than a discussion, and nastier than a lecture. It is a verbal attack that doesn't let up, delivered as a verb or received as a noun. Either way, it's pretty unpleasant."}, {"id": 45, "word": "luminous", "list_definition": "softly bright or radiant", "verbose_definition": "Luminous means full of or giving off light. During the winter holidays, with all their emphasis on light, you can see luminous displays of candles everywhere."}, {"id": 46, "word": "alacrity", "list_definition": "liveliness and eagerness", "verbose_definition": "Someone with alacrity shows cheerful willingness and eager behavior, like a kid whose mother has told him he can buy anything in a candy store."}, {"id": 47, "word": "condone", "list_definition": "excuse, overlook, or make allowances for", "verbose_definition": "If you condone something, you allow it, approve of it, or at least can live with it. Some teachers condone chewing gum, and some don't."}, {"id": 48, "word": "dormant", "list_definition": "inactive but capable of becoming active", "verbose_definition": "That old dog was dormant for so long he was confused for a furry doormat, but a doormat is likely to stay dormant, or inactive, because it is lifeless: that old dog has some life in him yet."}, {"id": 49, "word": "homogeneous", "list_definition": "all of the same or similar kind or nature", "verbose_definition": "If a group of things are homogeneous, they're all the same or similar, like a room full of identically dressed Elvis impersonators."}, {"id": 50, "word": "magnanimity", "list_definition": "nobility and generosity of spirit", "verbose_definition": "Magnanimous behavior is noble, generous, or unselfish, and to exhibit magnanimity is to be this way. He showed great magnanimity in not pressing charges when I drove his car into the pond. \"Accidents happen my friend,\" he said, and patted me on the back."}, {"id": 51, "word": "alleviate", "list_definition": "provide physical relief, as from pain", "verbose_definition": "Do all these words make your head ache? If so, take an aspirin to alleviate, or relieve, your pain."}, {"id": 52, "word": "confound", "list_definition": "be confusing or perplexing to", "verbose_definition": "If you have an identical twin, you've probably tried dressing alike so that people confound you with, or mistake you for, one another. You've also probably learned that, unfortunately, this trick doesn’t work on your mom."}, {"id": 53, "word": "dupe", "list_definition": "fool or hoax", "verbose_definition": "A dupe is a furry, ceremonial hat worn during ancient pagan rituals...or not. Dupe actually means “trick or deceive.” We’re sorry we tried to dupe you into believing the wrong definition."}, {"id": 54, "word": "hyperbole", "list_definition": "extravagant exaggeration", "verbose_definition": "Praising your favorite sports team is one thing, but if you call the team the most incredible group of humans ever to walk the earth, then you're going overboard and indulging in hyperbole."}, {"id": 55, "word": "malingerer", "list_definition": "someone shirking duty by feigning illness or incapacity", "verbose_definition": "Have you ever pretended to be sick or hurt to get out of taking a test or doing a chore? Then you, my dear, are a malingerer, and should be ashamed of yourself. Shape up!"}, {"id": 56, "word": "amalgamate", "list_definition": "bring or combine together or with something else", "verbose_definition": "To amalgamate is to combine different things to create something new. Institutions — such as banks, schools, or hospitals — often join forces and amalgamate with one other. But other things — like musical genres — get amalgamated as well."}, {"id": 57, "word": "connoisseur", "list_definition": "an expert able to appreciate a field", "verbose_definition": "A connoisseur is a person who, through study and interest, has a fine appreciation for something, like the connoisseur who can identify the clarinet player on a jazz recording by the sound of his inhalations alone."}, {"id": 58, "word": "ebullient", "list_definition": "joyously unrestrained", "verbose_definition": "More than chipper, more than happy, more than delighted is ebullient — meaning bubbling over with joy and delight."}, {"id": 59, "word": "iconoclastic", "list_definition": "characterized by attack on established beliefs", "verbose_definition": "The word iconoclastic is an adjective referring to a breaking of established rules or destruction of accepted beliefs. It might refer to an artist with an unorthodox style, or an iconoclastic attack, either physical or verbal, on a religious doctrine or image."}, {"id": 60, "word": "malleable", "list_definition": "capable of being shaped or bent", "verbose_definition": "A malleable metal is able to be pounded or pressed into various shapes, and a malleable personality is capable of being changed or trained. It's easier to learn when you're young and malleable."}, {"id": 61, "word": "ambiguous", "list_definition": "having more than one possible meaning", "verbose_definition": "Look to the adjective ambiguous when you need to describe something that's open to more than one interpretation, like the headline \"Squad helps dog bite victim.\""}, {"id": 62, "word": "contention", "list_definition": "the act of competing as for profit or a prize", "verbose_definition": "There is nothing \"content,\" or satisfying, about being in contention, and that's probably because the word contention means being in a competition that only one side can win."}, {"id": 63, "word": "eclectic", "list_definition": "selecting what seems best of various styles or ideas", "verbose_definition": "She listens to hip-hop, Gregorian chant, and folk music from the '60s. He's been seen wearing a handmade tuxedo jacket over a thrift-store flannel shirt. They both have eclectic tastes."}, {"id": 64, "word": "idolatry", "list_definition": "the worship of objects or images as gods", "verbose_definition": "Idolatry means the worship of images as if they were gods. Many religions prohibit idolatry, some even to the extent of forbidding any representational objects in houses of worship."}, {"id": 65, "word": "maverick", "list_definition": "someone who exhibits independence in thought and action", "verbose_definition": "A maverick is a rebel, someone who shows a lot of independence. A maverick on a motorcycle might blaze her own trail, traveling around the country and earning money by performing in rodeos."}, {"id": 66, "word": "ambivalence", "list_definition": "mixed feelings or emotions", "verbose_definition": "Someone who shows ambivalence about a person or thing has conflicting feelings. If you love your mom but find her totally embarrassing, you might feel ambivalent about having her give a presentation at your school."}, {"id": 67, "word": "contentious", "list_definition": "showing an inclination to disagree", "verbose_definition": "A contentious issue is one that people are likely to argue about, and a contentious person is someone who likes to argue or fight."}, {"id": 68, "word": "efficacy", "list_definition": "capacity or power to produce a desired result", "verbose_definition": "The degree to which a method or medicine brings about a specific result is its efficacy. You might not like to eat it, but you can't question the efficacy of broccoli as a health benefit."}, {"id": 69, "word": "immutable", "list_definition": "not subject or susceptible to change or variation", "verbose_definition": "If you can't change it, it's immutable. There are many things in life that are immutable; these unchangeable things include death, taxes, and the laws of physics."}, {"id": 70, "word": "mendacious", "list_definition": "given to lying", "verbose_definition": "A mendacious person is one who tells lies habitually and intentionally. Don't get stuck at the water cooler or bus stop next to someone you consider mendacious!"}, {"id": 71, "word": "ameliorate", "list_definition": "make better", "verbose_definition": "To ameliorate is to step in and make a bad situation better. You could try introducing a second lollipop to ameliorate a battle between two toddlers over a single lollipop."}, {"id": 72, "word": "contrite", "list_definition": "feeling or expressing pain or sorrow for sins or offenses", "verbose_definition": "We are sorry to inform you that the adjective contrite means regretful, remorseful, or even guilty."}, {"id": 73, "word": "effrontery", "list_definition": "audacious behavior that you have no right to", "verbose_definition": "If you rudely behave as if you have a right to something that you have no right to, you're committing effrontery. When a couple stroll into a crowded restaurant, demand the best table, and threaten the staff unless they're seated right away, that's effrontery."}, {"id": 74, "word": "impair", "list_definition": "make worse or less effective", "verbose_definition": "If you make bad decisions in the morning after drinking coffee, you might conclude that caffeine tends to impair your judgment. When you impair something, you damage it or make it work poorly."}, {"id": 75, "word": "metamorphosis", "list_definition": "striking change in appearance or character or circumstances", "verbose_definition": "In Kafka's novel entitled Metamorphosis, a man wakes up to find he has turned into a cockroach. That kind of complete and startling change pretty much sums up the word."}, {"id": 76, "word": "anachronism", "list_definition": "locating something at a time when it couldn't have existed", "verbose_definition": "An anachronism is something that doesn't fit its time period, like if you say you'll \"dial\" your smartphone."}, {"id": 77, "word": "conundrum", "list_definition": "a difficult problem", "verbose_definition": "The tricky word conundrum is used to describe a riddle or puzzle, sometimes including a play on words or pun."}, {"id": 78, "word": "elegy", "list_definition": "a mournful poem; a lament for the dead", "verbose_definition": "An elegy is a sad poem, usually written to praise and express sorrow for someone who is dead. Although a speech at a funeral is a eulogy, you might later compose an elegy to someone you have loved and lost to the grave."}, {"id": 79, "word": "impassive", "list_definition": "having or revealing little emotion or sensibility", "verbose_definition": "Someone who doesn't seem to react — who is always \"taking a pass\" in the conversation of life can be described as impassive."}, {"id": 80, "word": "meticulous", "list_definition": "marked by precise accordance with details", "verbose_definition": "Someone who is meticulous pays extreme attention to detail. If that person is, say, your surgeon or your accountant, you'll definitely want them to be meticulous!"}, {"id": 81, "word": "analogous", "list_definition": "similar or equivalent in some respects", "verbose_definition": "Use the adjective analogous to describe something that is similar to something else and can be compared to another."}, {"id": 82, "word": "converge", "list_definition": "be adjacent or come together", "verbose_definition": "Use the verb converge to describe something that comes together at a common point: “Thousands of Elvis fans plan to converge on the small Arkansas town where unconfirmed sightings of the deceased superstar eating at a local barbeque restaurant had been widely reported.”"}, {"id": 83, "word": "elicit", "list_definition": "call forth, as an emotion, feeling, or response", "verbose_definition": "When you elicit, you're bringing out a response of some sort. A good comedian elicits a lot of laughs."}, {"id": 84, "word": "impede", "list_definition": "be a hindrance or obstacle to", "verbose_definition": "To impede something is to delay or block its progress or movement. Carrying six heavy bags will impede your progress if you're trying to walk across town in a hurry."}, {"id": 85, "word": "misanthrope", "list_definition": "someone who dislikes people in general", "verbose_definition": "A misanthrope is a person who hates or mistrusts other people. Your great aunt Edna who lashes out at anyone who approaches, convinced they'll steal the jewelry she keeps in her handbag on her lap? A misanthrope indeed."}, {"id": 86, "word": "anarchy", "list_definition": "a state of lawlessness and disorder", "verbose_definition": "Use the noun anarchy to describe a complete lack of government — or the chaotic state of affairs created by such an absence. A substitute teacher might worry that an unruly classroom will descend into anarchy."}, {"id": 87, "word": "convoluted", "list_definition": "highly complex or intricate", "verbose_definition": "If something is convoluted, it's intricate and hard to understand. You'll need to read over your brother's convoluted investment scheme a few times before deciding whether or not to go in on it."}, {"id": 88, "word": "embellish", "list_definition": "make more attractive, as by adding ornament or color", "verbose_definition": "The word \"bell\" shows up in the middle of embellish, and bells are something that decorate, or embellish something, making it more attractive. If you embellish speech, though, it can get ugly if you add a lot of details that aren't true."}, {"id": 89, "word": "impermeable", "list_definition": "preventing especially liquids to pass or diffuse through", "verbose_definition": "If you have a waterproof raincoat, you could say that your coat is impermeable to the rain. Something that is impermeable does not allow water or liquid to pass through it."}, {"id": 90, "word": "mitigate", "list_definition": "lessen or to try to lessen the seriousness or extent of", "verbose_definition": "Choose the verb mitigate when something lessens the unpleasantness of a situation. You can mitigate your parents' anger by telling them you were late to dinner because you were helping your elderly neighbor."}, {"id": 91, "word": "anomalous", "list_definition": "deviating from the general or common order or type", "verbose_definition": "Something that deviates from the norm is anomalous. Something anomalous can be good, such as an exciting new direction in music or art. But that anomalously low score on your math test? Not so good."}, {"id": 92, "word": "craven", "list_definition": "lacking even the rudiments of courage; abjectly fearful", "verbose_definition": "A craven man is no Superman or Spiderman, nor is he a firefighter or a soldier. A craven man is the opposite of those guys: he has not an ounce of courage."}, {"id": 93, "word": "empirical", "list_definition": "derived from experiment and observation rather than theory", "verbose_definition": "If knowledge is empirical, it's based on observation rather than theory. To do an empirical study of donut shops, you'll need to visit every one you can find."}, {"id": 94, "word": "imperturbable", "list_definition": "marked by extreme calm and composure", "verbose_definition": "If you're imperturbable you are not easily upset. If your goal is to be imperturbable, then you can't let things bother you or get you stressed, confused, or angry."}, {"id": 95, "word": "mollify", "list_definition": "cause to be more favorably inclined", "verbose_definition": "To mollify is to calm someone down, talk them off the ledge, make amends, maybe even apologize."}, {"id": 96, "word": "antipathy", "list_definition": "a feeling of intense dislike", "verbose_definition": "An antipathy is a deep-seated dislike of something or someone. Usually it's a condition that is long-term, innate, and pretty unlikely to change — like your antipathy for the Red Sox."}, {"id": 97, "word": "daunt", "list_definition": "cause to lose courage", "verbose_definition": "Daunt means to frighten or scare off. The Cowardly Lion's efforts to daunt Dorothy, the Scarecrow, and the Tin Man were less than successful."}, {"id": 98, "word": "emulate", "list_definition": "strive to equal or match, especially by imitating", "verbose_definition": "When you emulate someone, you imitate them, especially with the idea of matching their success."}, {"id": 99, "word": "impervious", "list_definition": "not admitting of passage or capable of being affected", "verbose_definition": "An impervious surface is one that can't be penetrated. The word is often followed by \"to,\" as in \"His steely personality made him impervious to jokes about his awful haircut.\""}, {"id": 100, "word": "morose", "list_definition": "showing a brooding ill humor", "verbose_definition": "A morose person is sullen, gloomy, sad, glum, and depressed — not a happy camper."}, {"id": 101, "word": "apathy", "list_definition": "an absence of emotion or enthusiasm", "verbose_definition": "Use the noun apathy when someone isn't interested in the important things that are happening. You might feel apathy for the political process after watching candidates bicker tediously with one another."}, {"id": 102, "word": "decorum", "list_definition": "propriety in manners and conduct", "verbose_definition": "Decorum is proper and polite behavior. If you let out a big belch at a fancy dinner party, you're not showing much decorum."}, {"id": 103, "word": "endemic", "list_definition": "native to or confined to a certain region", "verbose_definition": "If you want to underscore just how commonly found and present something is within a particular place, try the word endemic. The saguaro cactus is endemic, or native, to the American southwest — so watch out for its sharp spines when you're hiking in Arizona!"}, {"id": 104, "word": "implacable", "list_definition": "incapable of being appeased or pacified", "verbose_definition": "An implacable person just can’t be appeased. If you really offended your best friend and tried every kind of apology but she refused to speak to you again, you could describe her as implacable."}, {"id": 105, "word": "mundane", "list_definition": "found in the ordinary course of events", "verbose_definition": "An ordinary, unexciting thing can be called mundane: \"Superman hid his heroic feats by posing as his mundane alter ego, Clark Kent.\""}, {"id": 106, "word": "appease", "list_definition": "make peace with", "verbose_definition": "Appease means to make or preserve peace with a nation, group, or person by giving in to their demands, or to relieve a problem, as in \"the cold drink appeased his thirst.\""}, {"id": 107, "word": "default", "list_definition": "an option that is selected automatically", "verbose_definition": "As a setting, a default is automatic.  You weren't sure why your new TV kept returning to the factory defaults until you realized you were sitting on the remote."}, {"id": 108, "word": "enervate", "list_definition": "weaken mentally or morally", "verbose_definition": "To enervate is to weaken, wear down, or even bum out. A three-hour lecture on the history of socks might thrill someone, it would enervate most people. So would a too-long soak in a hot tub. With your parents."}, {"id": 109, "word": "implicit", "list_definition": "suggested though not directly expressed", "verbose_definition": "Use the adjective implicit when you mean that something is understood but not clearly stated. You might think you and your boyfriend might have an implicit understanding that you are going to get married, but it's probably better to talk it through."}, {"id": 110, "word": "negate", "list_definition": "make ineffective by counterbalancing the effect of", "verbose_definition": "If something neutralizes the effect of something else, then you can say the effect is negated. Hanging a disco ball from your living room ceiling negates the sleek modern effect created by the contemporary furniture."}, {"id": 111, "word": "apprise", "list_definition": "inform somebody of something", "verbose_definition": "To apprise someone about something is to fill them in, to give them the scoop. If someone in your immediate family wins the mega-bucks lottery, you want to be the first one to be apprised of that event!"}, {"id": 112, "word": "deference", "list_definition": "courteous regard for people's feelings", "verbose_definition": "Sure you wear ripped jeans to school every day, but you don't wear them to your grandmother's house out of deference to her. When you show deference to someone, you make a gesture of respect."}, {"id": 113, "word": "engender", "list_definition": "call forth", "verbose_definition": "Engender is a fancy way of saying \"to make happen,\" like when you engender the spirit of teamwork and cooperation by encouraging others and doing your share of the group's work."}, {"id": 114, "word": "implode", "list_definition": "burst inward", "verbose_definition": "When something implodes, it explodes inward — instead of outward. With extremely large buildings, it helps to implode them rather than explode them, because by falling inward they take up less space."}, {"id": 115, "word": "neophyte", "list_definition": "any new participant in some activity", "verbose_definition": "A neophyte is someone who's brand new at something. You're a neophyte the first time you pick up a guitar and start learning to play."}, {"id": 116, "word": "approbation", "list_definition": "official acceptance or agreement", "verbose_definition": "Approbation is a formal word for approval or praise. Approbation is like getting the nod in a big way. Politicians rely on the public’s approbation to get elected."}, {"id": 117, "word": "delineate", "list_definition": "represented accurately or precisely", "verbose_definition": "Though you pronounce it duh-LIN-ee-ate, there is a \"line\" in the middle of delineate. This might help you remember that to delineate is to outline and define something in detail or with an actual marking of lines and boundaries."}, {"id": 118, "word": "enhance", "list_definition": "increase", "verbose_definition": "Many people use the expression \"enhance your chance\" to point out ways to increase your chances of winning or earning a contest or prize. When you enhance something, you heighten it or make it better."}, {"id": 119, "word": "inadvertently", "list_definition": "without knowledge or intention", "verbose_definition": "Inadvertently is an adverb that means \"without knowledge or intent,\" like when you inadvertently take someone else's coat from the coatroom because it looks just like yours."}, {"id": 120, "word": "obdurate", "list_definition": "stubbornly persistent in wrongdoing", "verbose_definition": "Obdurate is a formal word meaning stubborn. If you want to major in English, but your parents are obdurate that you should go premed, they might go so far as to threaten not to pay your tuition."}, {"id": 121, "word": "appropriate", "list_definition": "suitable for a particular person, place, or situation", "verbose_definition": "Something appropriate is correct and fits the situation. A sweater-vest with reindeer on it is appropriate holiday apparel, even if it's totally embarrassing."}, {"id": 122, "word": "denigrate", "list_definition": "attack the good name and reputation of someone", "verbose_definition": "To denigrate is to say bad things — true or false — about a person or thing. Your reputation as a math whiz might be hurt if your jealous classmate manages to denigrate you, even though the accusations are unfounded."}, {"id": 123, "word": "ephemeral", "list_definition": "anything short-lived, as an insect that lives only for a day", "verbose_definition": "Something that is fleeting or short-lived is ephemeral, like a fly that lives for one day or text messages flitting from cellphone to cellphone."}, {"id": 124, "word": "inchoate", "list_definition": "only partly in existence; imperfectly formed", "verbose_definition": "Inchoate means just beginning to form. You can have an inchoate idea, like the earliest flickers of images for your masterpiece, or an inchoate feeling, like your inchoate sense of annoyance toward your sister's new talking parrot."}, {"id": 125, "word": "obsequious", "list_definition": "attempting to win favor from influential people by flattery", "verbose_definition": "If you disapprove of the overly submissive way someone is acting — like the teacher's pet or a celebrity's assistant — call them by the formal adjective obsequious."}, {"id": 126, "word": "arduous", "list_definition": "characterized by effort to the point of exhaustion", "verbose_definition": "Use the adjective arduous to describe an activity that takes a lot of effort. Writing all those college essays and filling out the applications is an arduous process!"}, {"id": 127, "word": "deride", "list_definition": "treat or speak of with contempt", "verbose_definition": "The verb deride means to speak to someone with contempt or show a low opinion of someone or something. A bully might constantly deride other kids in his class — which might lead to many afternoons spent in the principal's office."}, {"id": 128, "word": "equanimity", "list_definition": "steadiness of mind under stress", "verbose_definition": "If you take the news of your parakeet's death with equanimity, it means you take it calmly without breaking down. Equanimity refers to emotional calmness and balance in times of stress."}, {"id": 129, "word": "incongruity", "list_definition": "the quality of disagreeing", "verbose_definition": "Incongruity means out of place — something that doesn't fit in its location or situation. The art show patrons couldn't help but chuckle at the incongruity of a toilet sitting in the middle of an exhibition of Renaissance paintings."}, {"id": 130, "word": "obviate", "list_definition": "do away with", "verbose_definition": "To obviate means to eliminate the need for something or to prevent something from happening. If you want to obviate the possibility of a roach infestation, clean your kitchen regularly."}, {"id": 131, "word": "artless", "list_definition": "simple and natural; without cunning or deceit", "verbose_definition": "Yes, artless could mean lacking in art, but more often it means lacking in superficiality or deceit. An artless person could never make a living as a con artist."}, {"id": 132, "word": "derivative", "list_definition": "a compound obtained from another compound", "verbose_definition": "Alert: shifting parts of speech! As a noun, a derivative is kind of financial agreement or deal. As an adjective, though, derivative describes something that borrows heavily from something else that came before it."}, {"id": 133, "word": "equivocate", "list_definition": "be deliberately ambiguous or unclear", "verbose_definition": "When you are unwilling to make a decision and almost intentionally go back and forth between two choices, you are equivocating. When politicians equivocate, they are often afraid of upsetting, and thus alienating, voters with their decisions."}, {"id": 134, "word": "inconsequential", "list_definition": "lacking worth or importance", "verbose_definition": "If something is considered of little worth or importance, it is inconsequential. If astronomers forecast a tremendous meteor shower, it might turn out to be no more than space junk, too inconsequential to record."}, {"id": 135, "word": "occlude", "list_definition": "block passage through", "verbose_definition": "Occlude means to obstruct, as with an opening. You hear this a lot in a medical context. Heart surgeons are looking for occlusions in blood vessels — things that occlude the flow of blood."}, {"id": 136, "word": "ascetic", "list_definition": "someone who practices self denial as a spiritual discipline", "verbose_definition": "Want to live an ascetic lifestyle? Then you better ditch the flat panel TV and fuzzy slippers. To be ascetic, you learn to live without; it's all about self-denial."}, {"id": 137, "word": "desiccate", "list_definition": "lacking vitality or spirit; lifeless", "verbose_definition": "The verb desiccate means to dry out, dry up and dehydrate. It's helpful to desiccate weeds but certainly not crops."}, {"id": 138, "word": "erudite", "list_definition": "having or showing profound knowledge", "verbose_definition": "If you call someone erudite, that means they show great learning. After you've earned your second Ph.D., you will be truly erudite."}, {"id": 139, "word": "incorporate", "list_definition": "make into a whole or make part of a whole", "verbose_definition": "To incorporate is to include or integrate a part into the whole. Incorporate is a more active version of the word \"include\"; if you incorporate, you are adding something to the mix."}, {"id": 140, "word": "officious", "list_definition": "intrusive in a meddling or offensive manner", "verbose_definition": "Though officious sounds like official, it means being annoyingly eager to do more than is required. \"The officious lunch lady made everyone's food choices her business, and made nasty comments when students chose cookies over carrots.\""}, {"id": 141, "word": "assiduous", "list_definition": "marked by care and persistent effort", "verbose_definition": "If you call someone assiduous, it's a compliment. It means they're careful, methodical and very persistent. Good detectives are classically assiduous types."}, {"id": 142, "word": "desultory", "list_definition": "marked by lack of definite plan, purpose, or enthusiasm", "verbose_definition": "If you lack a definite plan or purpose and flit from one thing to another, your actions are desultory. Some people call such desultory wanderings spontaneous. Others call it \"being lost.\""}, {"id": 143, "word": "esoteric", "list_definition": "understandable only by an enlightened inner circle", "verbose_definition": "Pssst... do you know the secret handshake? If you haven't been brought into the inner circle of those with special knowledge, esoteric things will remain a mystery to you."}, {"id": 144, "word": "indeterminate", "list_definition": "not fixed or known in advance", "verbose_definition": "Indeterminate means not known or decided. When someone contracts a rare stomach parasite but has not been traveling internationally, you might say it had indeterminate origins."}, {"id": 145, "word": "onerous", "list_definition": "burdensome or difficult to endure", "verbose_definition": "If one teacher gives you three hours of homework a night, that's rough. But if all of your teachers do it, that makes the task of completing your homework an onerous one, to say the least. If something is onerous, it is very difficult to deal with or do."}, {"id": 146, "word": "assuage", "list_definition": "provide physical relief, as from pain", "verbose_definition": "If you assuage an unpleasant feeling, you make it go away. Assuaging your hunger by eating a bag of marshmallows may cause you other unpleasant feelings."}, {"id": 147, "word": "deterrent", "list_definition": "something immaterial that interferes with action or progress", "verbose_definition": "A deterrent makes you not want to do something. Let's say there's a giant pile of cookies being guarded by an angry dog — the dog is a deterrent."}, {"id": 148, "word": "eulogy", "list_definition": "a formal expression of praise for someone who has died", "verbose_definition": "At every funeral, there comes a moment when someone speaks about the life of the person who died. The speaker is delivering what is known as a eulogy. A eulogy is a formal speech that praises a person who has died."}, {"id": 149, "word": "indigence", "list_definition": "a state of extreme poverty or destitution", "verbose_definition": "Indigence is a synonym for extreme poverty. If you experience indigence, you have a critical need for food, money, and other resources."}, {"id": 150, "word": "opprobrium", "list_definition": "a state of extreme dishonor", "verbose_definition": "If you go against or oppose what's good, you might earn opprobrium — the opposite of getting attention for something good. Bad behavior leads to opprobrium. If you throw a soft drink off the theater balcony, the opprobrium might keep you from getting dates to the movies."}, {"id": 151, "word": "attenuate", "list_definition": "become weaker, in strength, value, or magnitude", "verbose_definition": "Attenuate is a verb that means to make or become weaker. The effects of aging may be attenuated by exercise — or by drinking from the fountain of youth."}, {"id": 152, "word": "diatribe", "list_definition": "thunderous verbal attack", "verbose_definition": "It's pretty overwhelming when you ask your friend a seemingly innocuous question, like \"Do you like hot dogs?\" and she unleashes a diatribe about the evils of eating meat. A diatribe is an angry, critical speech."}, {"id": 153, "word": "euphemism", "list_definition": "an inoffensive expression substituted for an offensive one", "verbose_definition": "Pardon me, but when a polite term is substituted for a blunt, offensive one, you should call it a euphemism."}, {"id": 154, "word": "indolent", "list_definition": "disinclined to work or exertion", "verbose_definition": "Indolent is an adjective meaning slow or lazy. It can take an indolent teenager hours to get out of bed on a weekend morning. Often it's noon before he finally comes shuffling down to breakfast in his pajamas."}, {"id": 155, "word": "oscillate", "list_definition": "move or swing from side to side regularly", "verbose_definition": "On a hot day, you’ll be happy to have a fan that can oscillate, meaning it moves back and forth in a steady motion."}, {"id": 156, "word": "audacious", "list_definition": "disposed to venture or take risks", "verbose_definition": "This adjective is very bold — if you are audacious, you are daring and unconventional!"}, {"id": 157, "word": "dichotomy", "list_definition": "a classification into two opposed parts or subclasses", "verbose_definition": "A dichotomy is an idea or classification split in two. When you point out a dichotomy, you draw a clear distinction between two things."}, {"id": 158, "word": "exacerbate", "list_definition": "make worse", "verbose_definition": "For a formal-sounding verb that means to make worse, try exacerbate. If you're in trouble, complaining about it will only exacerbate the problem."}, {"id": 159, "word": "inert", "list_definition": "unable to move or resist motion", "verbose_definition": "Something that's unable to move or moving without much energy can be described as inert. Wind up in a body cast and you’ll find yourself not only itchy, but totally inert."}, {"id": 160, "word": "ostentatious", "list_definition": "intended to attract notice and impress others", "verbose_definition": "Reach for the adjective ostentatious when you want a flashy way to say — well, \"flashy\" or \"showy.\""}, {"id": 161, "word": "austere", "list_definition": "of a stern or strict bearing or demeanor", "verbose_definition": "The adjective austere is used to describe something or someone stern or without any decoration. You wouldn't want someone to describe you or your home as austere."}, {"id": 162, "word": "diffidence", "list_definition": "lack of self-assurance", "verbose_definition": "The noun diffidence refers to a lack of self-confidence. Your diffidence might be the reason why you never say \"hi\" to the cute guy or gal in the elevator or why you never ask for a raise."}, {"id": 163, "word": "exculpate", "list_definition": "pronounce not guilty of criminal charges", "verbose_definition": "To exculpate means to find someone not guilty of criminal charges. If you've been wrongly accused of robbery, you'd better hope a judge will exculpate you, unless you want to go to jail because you've heard prison food is amazing."}, {"id": 164, "word": "pate", "list_definition": "liver or meat or fowl finely minced or ground and variously seasoned", "verbose_definition": "Your pate is the top of your head. But say the word with a French accent, and voila! Now it’s a savory spread made of ground meat and spices. Pâté (the food!) is sometimes served with bread or crackers."}, {"id": 165, "word": "ingenuous", "list_definition": "lacking in sophistication or worldliness", "verbose_definition": "Someone who is ingenuous shows a childlike innocence, trust, and openness. One of the things kindergarten teachers value is the chance to work with kids while they're still relatively ingenuous––their open, trusting natures are a joy."}, {"id": 166, "word": "paragon", "list_definition": "a perfect embodiment of a concept", "verbose_definition": "Paragon applies to someone who is a model of perfection in some quality or trait. We link paragon with other words that follow it, such as \"paragon of virtue\" or \"paragon of patience.\""}, {"id": 167, "word": "autonomous", "list_definition": "existing as an independent entity", "verbose_definition": "Autonomous describes things that function separately or independently. Once you move out of your parents' house and get your own job, you will be an autonomous member of the family."}, {"id": 168, "word": "diffuse", "list_definition": "spread out; not concentrated in one place", "verbose_definition": "Diffuse means to spread out. Candlelight can diffuse a soft glow throughout a room. A diffuse idea is one that spreads from person to person, and a diffuse speech is scattered and unclear."}, {"id": 169, "word": "exigency", "list_definition": "a pressing or urgent situation", "verbose_definition": "Think of a mix of excitement and emergency, and you have exigency, a sudden, urgent crisis. The very word conjures up danger and intrigue that demand a cool head and an immediate effort at a solution."}, {"id": 170, "word": "inherent", "list_definition": "existing as an essential constituent or characteristic", "verbose_definition": "Use the adjective inherent for qualities that are considered permanent or cannot be separated from an essential character."}, {"id": 171, "word": "partisan", "list_definition": "a fervent and even militant proponent of something", "verbose_definition": "If something is prejudicial towards a particular point of view, you can call it partisan. You'll often hear of the partisan politics in the U.S.— since politicians seem to be completely devoted to the agendas of their own parties."}, {"id": 172, "word": "aver", "list_definition": "declare or affirm solemnly and formally as true", "verbose_definition": "To aver is to state something or declare something is true. This verb has a serious tone, so you might aver something on a witness stand or you might aver that you won't back down to a challenge."}, {"id": 173, "word": "digression", "list_definition": "a message that departs from the main subject", "verbose_definition": "When your essay about French cooking starts describing a childhood trip to Disneyland, it's taken a digression — it's strayed from the main topic."}, {"id": 174, "word": "extrapolation", "list_definition": "an inference about the future based on known facts", "verbose_definition": "An extrapolation is kind of like an educated guess or a hypothesis. When you make an extrapolation, you take facts and observations about a present or known situation and use them to make a prediction about what might eventually happen."}, {"id": 175, "word": "innocuous", "list_definition": "not injurious to physical or mental health", "verbose_definition": "Something that's innocuous isn't harmful or likely to cause injury. Public figures like mayors and governors have to expect they'll get critical or even hurtful emails and phone calls, as well as more innocuous feedback."}, {"id": 176, "word": "pathological", "list_definition": "relating to the study of diseases", "verbose_definition": "If something is caused by a physical or mental disease, it is pathological. Someone with a pathological compulsion for cleanliness might scrub the floors for hours every night."}, {"id": 177, "word": "banal", "list_definition": "repeated too often; overfamiliar through overuse", "verbose_definition": "If something is boring and unoriginal, it's banal. Banal things are dull as dishwater."}, {"id": 178, "word": "dirge", "list_definition": "a song or hymn of mourning as a memorial to a dead person", "verbose_definition": "A dirge is a song of mourning, performed as a memorial to someone who’s died. As you might imagine, a dirge is usually quite sad. Another word with a similar meaning that you might know is “requiem.”"}, {"id": 179, "word": "facetious", "list_definition": "cleverly amusing in tone", "verbose_definition": "Don’t take a facetious comment seriously because it’s supposed to be funny. Anything facetious is a joke. If you've just won a hotdog-eating contest and someone asks if you'd like to go out for burgers, they’re probably being facetious."}, {"id": 180, "word": "insensible", "list_definition": "barely able to be perceived", "verbose_definition": "The adjective insensible is used to describe someone who is unconscious. If you keep your bowling ball on the top shelf of the closet and it rolls out and conks you on the head, you will be probably rendered insensible."}, {"id": 181, "word": "paucity", "list_definition": "an insufficient quantity or number", "verbose_definition": "The word paucity means not enough of something. If you've got a paucity of good cheer, for example, you'd better cheer up!"}, {"id": 182, "word": "belie", "list_definition": "be in contradiction with", "verbose_definition": "To belie means to contradict. If you are 93 but look like you are 53, then your young looks belie your age."}, {"id": 183, "word": "disabuse", "list_definition": "free somebody from an erroneous belief", "verbose_definition": "Disabuse means to free someone of a belief that is not true. Many teachers of health find that when they teach, they spend as much energy disabusing kids of false beliefs as they do giving them the facts."}, {"id": 184, "word": "facilitate", "list_definition": "make easier", "verbose_definition": "To facilitate means to make something easier. If your best friend is very shy, you could facilitate her efforts to meet new people."}, {"id": 185, "word": "insinuate", "list_definition": "suggest in an indirect or covert way; give to understand", "verbose_definition": "Insinuate means you imply or suggest something that may or may not be true. If you say things seemed to go wrong about the time your brother took over, you insinuate that he had something to do with the decline."}, {"id": 186, "word": "pedantic", "list_definition": "marked by a narrow focus on or display of learning", "verbose_definition": "There's nothing wrong with focusing on the details, but someone who is pedantic makes a big display of knowing obscure facts and details."}, {"id": 187, "word": "beneficent", "list_definition": "doing or producing good", "verbose_definition": "Beneficent is the type of act that helps others. If you're a beneficent person, you probably spend a lot of your time volunteering at soup kitchens or homeless shelters, helping people who are less fortunate than you are."}, {"id": 188, "word": "discerning", "list_definition": "having or revealing keen insight and good judgment", "verbose_definition": "Discerning people pick up on subtle traits and are good judges of quality — they're the ones who can tell if your cupcakes are homemade from the finest ingredients or totally from a box mix."}, {"id": 189, "word": "fallacious", "list_definition": "containing or based on incorrect reasoning", "verbose_definition": "Something fallacious is a mistake that comes from too little information or unsound sources. Predictions that the whole state of California will snap off from the rest of North America and float away have proven to be fallacious — for now, anyway."}, {"id": 190, "word": "insipid", "list_definition": "lacking interest or significance or impact", "verbose_definition": "Something insipid is lacking in flavor or interest. You'll probably find the generic poems inside of greeting cards insipid."}, {"id": 191, "word": "penchant", "list_definition": "a strong liking", "verbose_definition": "A penchant is a strong preference or tendency. If you have a penchant for pizza, you either eat it daily or wish you did."}, {"id": 192, "word": "bolster", "list_definition": "support and strengthen", "verbose_definition": "When you cheer up a friend who's feeling down, you bolster them. To bolster is to offer support or strengthen."}, {"id": 193, "word": "discordant", "list_definition": "not in agreement or harmony", "verbose_definition": "If you believe that movies should entertain, but your friend insists that movies should inspire, then the two of you hold discordant views on the purpose of movies. That means your opinions are in conflict."}, {"id": 194, "word": "fatuous", "list_definition": "devoid of intelligence", "verbose_definition": "Fatuous means lacking intelligence. When your mother outlaws calling your brother stupid, use fatuous instead."}, {"id": 195, "word": "insularity", "list_definition": "the state of being isolated or detached", "verbose_definition": "The noun insularity refers to the quality of being isolated or detached. In fact, the word is based on the Latin word insula, for \"island.\" The phrase \"no man is an island\" means that no one can be completely separate from others."}, {"id": 196, "word": "penury", "list_definition": "a state of extreme poverty or destitution", "verbose_definition": "Penury means extreme poverty to the point of homelessness and begging in the streets. Economic downturns, job loss, shopping sprees, and weekends at the high rollers' table in Vegas can lead to penury."}, {"id": 197, "word": "bombastic", "list_definition": "ostentatiously lofty in style", "verbose_definition": "To be bombastic is to be full of hot air — like a politician who makes grand promises and doesn't deliver."}, {"id": 198, "word": "discredit", "list_definition": "the state of being held in low esteem", "verbose_definition": "Discredit means to cause mistrust or cast the accuracy of something into doubt. If you say that schooling is important to you, but you never study, your actions discredit you and your words."}, {"id": 199, "word": "fawning", "list_definition": "attempting to win favor by flattery", "verbose_definition": "Use fawning to describe someone who's over the top in the flattery department. Like a fawning admirer who just won't stop complimenting your looks, showering you with gifts and otherwise kissing the ground you walk on."}, {"id": 200, "word": "intractable", "list_definition": "difficult to manage or mold", "verbose_definition": "Can't manage your stubborn little brother who won't do what anyone says? You could call him intractable, or you could call your mother. Problems are intractable when they can't be solved."}, {"id": 201, "word": "perennial", "list_definition": "lasting an indefinitely long time", "verbose_definition": "Perennial typically describes things that are permanent, constant, or repeated. If you fight with your parents every year over whether they really must invite your annoying cousins for Thanksgiving, you could call that a perennial conflict."}, {"id": 202, "word": "boorish", "list_definition": "ill-mannered and coarse in behavior or appearance", "verbose_definition": "If your cousin tells revolting jokes, belches, and smells like he spent the winter in a cave, he could be described as boorish — an adjective used for people with bad manners and a sloppy appearance."}, {"id": 203, "word": "discrepancy", "list_definition": "a difference between conflicting facts or claims or opinions", "verbose_definition": "A discrepancy is a lack of agreement or balance. If there is a discrepancy between the money you earned and the number on your paycheck, you should complain to your boss."}, {"id": 204, "word": "felicitous", "list_definition": "exhibiting an agreeably appropriate manner or style", "verbose_definition": "Felicitous describes something that's pleasantly apt or fitting. Felicitous words you write on your friend's birthday card are the ones that perfectly suit the occasion and make her happy when she reads them."}, {"id": 205, "word": "intransigence", "list_definition": "stubborn refusal to compromise or change", "verbose_definition": "If you refuse to compromise with your sister about whose turn it is to do the dishes, your mother might accuse you both of intransigence. Intransigence is a stubborn refusal to change your views."}, {"id": 206, "word": "perfidious", "list_definition": "tending to betray", "verbose_definition": "If someone accuses you of being perfidious, you should probably be offended — it means underhanded, treacherous, deceitful — even evil."}, {"id": 207, "word": "burgeon", "list_definition": "grow and flourish", "verbose_definition": "Use the verb burgeon to describe something that is growing, expanding, and flourishing. If you have a green thumb, in the spring your flower gardens may burgeon. If you don't have a green thumb, your collection of plastic plants may burgeon."}, {"id": 208, "word": "discrete", "list_definition": "constituting a separate entity or part", "verbose_definition": "Discrete means separate or divided. A discrete unit is a separate part of something larger. A room is a discrete space within a house, just as the crankshaft is a discrete part of a car engine."}, {"id": 209, "word": "fervor", "list_definition": "feelings of great warmth and intensity", "verbose_definition": "Use fervor to describe an intensity of emotion or expression. Fans of the Los Angeles Dodgers show so much fervor that they \"bleed Dodger blue.\""}, {"id": 210, "word": "inundate", "list_definition": "fill or cover completely, usually with water", "verbose_definition": "To inundate means to quickly fill up or overwhelm, just like a flood. Your bathroom could be inundated with water if the pipes burst, and hopefully your inbox is inundated with nice emails on your birthday."}, {"id": 211, "word": "perfunctory", "list_definition": "hasty and without attention to detail; not thorough", "verbose_definition": "Perfunctory means done as part of a routine or duty. If you give someone a gift and they look at it like it's roadkill and say nothing but a perfunctory \"thank you,\" you might not be giving them another one anytime soon."}, {"id": 212, "word": "burnish", "list_definition": "polish and make shiny", "verbose_definition": "That seductive gleam on that Porsche behind the dealer's window? It's called a burnish, a gloss only achieved by loads of polishing. Likewise, you can burnish a resume by polishing it until it's perfect."}, {"id": 213, "word": "disingenuous", "list_definition": "not straightforward or candid", "verbose_definition": "Use the adjective disingenuous to describe behavior that's not totally honest or sincere. It's disingenuous when people pretend to know less about something than they really do."}, {"id": 214, "word": "flag", "list_definition": "a rectangular piece of cloth of distinctive design", "verbose_definition": "A flag is a piece of cloth that represents a country, group, or institution. If you're particularly proud of your Irish heritage, you might fly an Irish flag in your front yard."}, {"id": 215, "word": "inured", "list_definition": "made tough by habitual exposure", "verbose_definition": "If you have gotten so many mosquito bites in your life that they no longer bother you, you have become inured to them. This means you have become accustomed to tolerating them."}, {"id": 216, "word": "permeable", "list_definition": "allowing fluids or gases to pass or diffuse through", "verbose_definition": "Something that is permeable can be passed through, especially by liquids or gases. \"I wish I hadn't worn my permeable sweater to the picnic when the weatherman called for thunderstorms. The rain seeped right through the fabric, soaking me to the skin.\""}, {"id": 217, "word": "buttress", "list_definition": "a support usually of stone or brick", "verbose_definition": "You can buttress an argument with solid facts or your financial portfolio with safe investments. You may find that giving compliments to everyone you meet buttresses your popularity. To buttress is to sustain or reinforce."}, {"id": 218, "word": "disinterested", "list_definition": "unaffected by concern for one's own welfare", "verbose_definition": "If you can't decide whether to purchase the shirt with orange polka dots or the purple paisley-patterned one, you might seek input from a disinterested, or unbiased, party (who will probably tell you not to buy either one)."}, {"id": 219, "word": "fledgling", "list_definition": "young bird that has just become capable of flying", "verbose_definition": "A fledgling is a fuzzy baby bird just learning to fly, or someone (like a baby bird) who's brand new at doing something. Awww."}, {"id": 220, "word": "invective", "list_definition": "abusive language used to express blame or censure", "verbose_definition": "Invective is harsh, abusive language, like \"you dirty rotten scoundrel.\"  I'm sure you can think of harsher and more obscene examples, but we won't get into them here."}, {"id": 221, "word": "pervasive", "list_definition": "spreading or spread throughout", "verbose_definition": "When something is pervasive, it's everywhere. Common things are pervasive — like greed and cheap perfume."}, {"id": 222, "word": "cacophonous", "list_definition": "having an unpleasant sound", "verbose_definition": "The adjective cacophonous describes loud, harsh sounds, like the cacophonous racket your brother and his band mates make while trying to learn how to play their instruments."}, {"id": 223, "word": "disjointed", "list_definition": "taken apart at the points of connection", "verbose_definition": "Disjointed isn’t when you can bend your thumb all the way backwards — that’s double-jointed. Disjointed means \"unorganized\" or \"disconnected.\""}, {"id": 224, "word": "flout", "list_definition": "treat with contemptuous disregard", "verbose_definition": "To flout is to scorn or show contempt for. \"I flout the law and the concept of civilian safety by making a concerted effort to jaywalk every time I cross a street.\""}, {"id": 225, "word": "irascible", "list_definition": "quickly aroused to anger", "verbose_definition": "If you're irascible, you get angry easily — perhaps blowing up in rage when someone brushes into you."}, {"id": 226, "word": "phlegmatic", "list_definition": "showing little emotion", "verbose_definition": "Yes, phlegmatic has roots in that colorless, mucousy stuff called phlegm, but people who are phlegmatic aren't called that because they have lots of mucus. They are just a little dull in expressing feelings or showing emotion."}, {"id": 227, "word": "capricious", "list_definition": "determined by chance or impulse rather than by necessity", "verbose_definition": "Capricious is an adjective to describe a person or thing that's impulsive and unpredictable, like a bride who suddenly leaves her groom standing at the wedding altar."}, {"id": 228, "word": "dismiss", "list_definition": "stop associating with", "verbose_definition": "At the end of a lesson period, your teacher says, \"class dismissed.\" This means that you and the rest of the students are free to go."}, {"id": 229, "word": "foment", "list_definition": "try to stir up", "verbose_definition": "Stand outside the school cafeteria passing out flyers with nutritional details on school food, and you may foment a revolution — foment means stirring up something undesirable, such as trouble."}, {"id": 230, "word": "irresolute", "list_definition": "uncertain how to act or proceed", "verbose_definition": "Irresolute describes someone who feels stuck. A decision must be made, a plan acted on, but the irresolute person just doesn't know what to do."}, {"id": 231, "word": "piety", "list_definition": "righteousness by virtue of being religiously devout", "verbose_definition": "Piety is devotion to God or to religious practices. Nuns who pray all day long are famous for their piety. If you have filial piety it means you're devoted to your parents."}, {"id": 232, "word": "castigation", "list_definition": "verbal punishment", "verbose_definition": "If your coach yells at your team for sloppy play, her post-game speech might be called a castigation. A castigation is a harsh verbal reprimand."}, {"id": 233, "word": "disparage", "list_definition": "express a negative opinion of", "verbose_definition": "If you haven't got anything nice to say, then it's time to disparage someone. It means to belittle or degrade a person or idea."}, {"id": 234, "word": "forestall", "list_definition": "keep from happening or arising; make impossible", "verbose_definition": "It takes a bit of planning to forestall something, meaning stop it from happening. To forestall the effects of aging, exercise and take care of your health all your life."}, {"id": 235, "word": "itinerary", "list_definition": "an established line of travel or access", "verbose_definition": "An itinerary is your travel plan — where you will go and when you will be there."}, {"id": 236, "word": "placate", "list_definition": "cause to be more favorably inclined", "verbose_definition": "If you placate someone, you stop them from being angry by giving them something or doing something that pleases them. If your dad is annoyed that you forgot to take out the trash, you might be able to placate him by doing the dishes."}, {"id": 237, "word": "catalyst", "list_definition": "substance that initiates or accelerates a chemical reaction", "verbose_definition": "A catalyst is an event or person causing a change. Getting kicked out of your parents' house might be a catalyst for becoming more independent."}, {"id": 238, "word": "disparate", "list_definition": "fundamentally different or distinct in quality or kind", "verbose_definition": "The trunk of some people's cars may contain items as disparate as old clothes, rotting food, and possibly a missing relative. Disparate things are very different from each other."}, {"id": 239, "word": "frugality", "list_definition": "prudence in avoiding waste", "verbose_definition": "If you try to avoid waste by reusing and repurposing items that most people would throw away, your frugality will save you money."}, {"id": 240, "word": "laconic", "list_definition": "brief and to the point", "verbose_definition": "Laconic is an adjective that describes a style of speaking or writing that uses only a few words, often to express complex thoughts and ideas.  A more laconic way to write that last sentence might be this: laconic means brief."}, {"id": 241, "word": "plasticity", "list_definition": "the property of being physically malleable", "verbose_definition": "Plasticity means \"changeability\" or \"moldability\" — clay has a lot of plasticity, but a rock has almost none."}, {"id": 242, "word": "caustic", "list_definition": "capable of destroying or eating away by chemical action", "verbose_definition": "Use the adjective caustic to describe any chemical that is able to burn living tissue or other substances, or, figuratively, a statement that has a similarly burning effect. Caustic in this sense means harshly critical."}, {"id": 243, "word": "dissemble", "list_definition": "behave unnaturally or affectedly", "verbose_definition": "To dissemble is to hide under a false appearance, to deceive. \"When confronted about their human rights record, the Chinese government typically dissembles.\""}, {"id": 244, "word": "futile", "list_definition": "producing no result or effect", "verbose_definition": "When something fails to deliver a useful result, you can call it futile. Hopefully all the time you're spending studying vocabulary won't turn out to be futile!"}, {"id": 245, "word": "lassitude", "list_definition": "a feeling of lack of interest or energy", "verbose_definition": "If you are feeling lassitude, you're weary and just can't be bothered. Couch potatoes make lassitude into an art form."}, {"id": 246, "word": "platitude", "list_definition": "a trite or obvious remark", "verbose_definition": "If an executive gives a speech that begins, \"This business is all about survival of the fittest. You need to burn the midnight oil and take one for the team,\" his employees might get sick of listening to these meaningless clichés and tell him to cut the platitudes."}, {"id": 247, "word": "plethora", "list_definition": "extreme excess", "verbose_definition": "Plethora means an abundance or excess of something. If you have 15 different people who want to take you on a date, you have a plethora of romantic possibilities."}, {"id": 248, "word": "propitiate", "list_definition": "make peace with", "verbose_definition": "If you forgot flowers on your Mom's birthday, you can still propitiate her by sending a bouquet the next day. Propitiate means to appease someone or make them happy by doing a particular thing. Handy strategy for lovers, too."}, {"id": 249, "word": "rescind", "list_definition": "cancel officially", "verbose_definition": "If you get a call saying a company has decided to rescind your job offer, it's back to the classifieds for you. Rescind means to cancel or revoke."}, {"id": 250, "word": "sporadic", "list_definition": "recurring in scattered or unpredictable instances", "verbose_definition": "Sporadic is an adjective that you can use to refer to something that happens or appears often, but not constantly or regularly. The mail carrier comes every day but the plumber's visits are sporadic — he comes as needed."}, {"id": 251, "word": "tractable", "list_definition": "easily managed", "verbose_definition": "If your little brother quietly obeys your instructions and waits for you at the food court while you and your friends wander around the mall, he's probably a tractable child, meaning he's obedient, flexible, and responds well to directions."}, {"id": 252, "word": "plummet", "list_definition": "drop sharply", "verbose_definition": "The verb plummet means \"to drop sharply,\" like eagles that plummet toward earth, seeking prey, or school attendance that plummets when there is a flu outbreak."}, {"id": 253, "word": "propriety", "list_definition": "correct behavior", "verbose_definition": "Propriety is following what is socially acceptable in speech and behavior. If you are someone who cares about always doing the right and proper thing, your friends might accuse you of being obsessed with propriety and beg you to loosen up."}, {"id": 254, "word": "resolution", "list_definition": "a decision to do something or to behave in a certain manner", "verbose_definition": "The noun resolution has a few related meanings having to do with being firmly determined about something. If you lack determination, you'll never fulfill your New Year's resolutions."}, {"id": 255, "word": "stigma", "list_definition": "a symbol of disgrace or infamy", "verbose_definition": "If something has a negative association attached to it, call this a stigma. Bed-wetting can lead to a social stigma for a six-year-old, while chewing tobacco might have the same effect for a sixty-year-old."}, {"id": 256, "word": "transgression", "list_definition": "the violation of a law or a duty or moral principle", "verbose_definition": "A transgression is something that is against a command or law. Whether you are cheating on a test, or cheating on a spouse, you are committing transgressions that are not easily forgiven."}, {"id": 257, "word": "porous", "list_definition": "full of holes", "verbose_definition": "If something is full of tiny holes or openings, you can describe it as porous. A sponge is porous, and if the border between countries is open for anyone to cross easily, it too can be called porous."}, {"id": 258, "word": "proscribe", "list_definition": "command against", "verbose_definition": "To proscribe something is to forbid or prohibit it, as a school principal might proscribe the use of cell phones in class."}, {"id": 259, "word": "resolve", "list_definition": "find a solution or answer", "verbose_definition": "To resolve is to settle or make a decision about something — often formal. A college's board of directors  might resolve to recruit more minority students. As a noun, resolve refers to a strong determination to do something."}, {"id": 260, "word": "stint", "list_definition": "supply sparingly and with restricted quantities", "verbose_definition": "The noun stint means a set amount of time in which you do something — often work of some sort. \"She served a stint in the army, followed by a stint in an office setting, before settling on a career as a lounge singer.\""}, {"id": 261, "word": "truculence", "list_definition": "stubborn and defiant aggressiveness", "verbose_definition": "If you get into fights all of the time, you might be accused of truculence and sent for anger management classes. Truculence is showing a fierce kind of aggression."}, {"id": 262, "word": "pragmatic", "list_definition": "concerned with practical matters", "verbose_definition": "To describe a person or a solution that takes a realistic approach, consider the adjective pragmatic. The four-year-old who wants a unicorn for her birthday isn't being very pragmatic."}, {"id": 263, "word": "pungent", "list_definition": "strong and sharp to the sense of taste or smell", "verbose_definition": "Use pungent to describe a taste or smell that gives a sharp sensation. \"What is that pungent odor?\" is a polite way of suggesting that someone in the room has BO."}, {"id": 264, "word": "reticent", "list_definition": "reluctant to draw attention to yourself", "verbose_definition": "Reticent means either quiet or restrained. If you're reticent about your feelings, you like to keep them to yourself, and you're probably quiet in rowdy groups where everyone is talking over each other."}, {"id": 265, "word": "stipulate", "list_definition": "make an express demand or provision in an agreement", "verbose_definition": "To stipulate something means to demand that it be part of an agreement. So when you make a contract or deal, you can stipulate that a certain condition must be met."}, {"id": 266, "word": "vacillate", "list_definition": "be undecided about something", "verbose_definition": "Vacillate means to waver back and forth, unable to decide. You might vacillate between ordering waffles and pancakes at your favorite diner — it’s hard to pick just one when both are so tasty!"}, {"id": 267, "word": "preamble", "list_definition": "a preliminary introduction, as to a statute or constitution", "verbose_definition": "A preamble is a brief introduction to a speech, like the Preamble to the Constitution that starts out \"We the People of the United States, in Order to form a more perfect Union...do ordain and establish this Constitution.\""}, {"id": 268, "word": "qualified", "list_definition": "meeting the proper standards and requirements for a task", "verbose_definition": "Qualified means something depends on another action occurring. If your friend receives a qualified offer on her house, that means something else has to happen — like a bank approving the loan — before it's sold."}, {"id": 269, "word": "reverent", "list_definition": "feeling or showing profound respect or veneration", "verbose_definition": "When you have great awe and respect for someone or something, and you show it by respectfully worshiping that person, thing, deity, or musical group, you are being reverent."}, {"id": 270, "word": "stolid", "list_definition": "having or revealing little emotion or sensibility", "verbose_definition": "A stolid person can’t be moved to smile or show much sign of life, in much the same way as something solid, like a giant boulder, is immovable. Both are expressionless."}, {"id": 271, "word": "venerate", "list_definition": "regard with feelings of respect and reverence", "verbose_definition": "To venerate is to worship, adore, be in awe of. You probably don't venerate your teacher or boss; however, you may act like you do!"}, {"id": 272, "word": "precarious", "list_definition": "not secure; beset with difficulties", "verbose_definition": "Grab for the adjective precarious when something is unstable, dangerous or difficult and likely to get worse. Are you totally broke and the people you owe money to keep calling? You're in a precarious financial situation!"}, {"id": 273, "word": "quibble", "list_definition": "evade the truth of a point by raising irrelevant objections", "verbose_definition": "A quibble is a small argument or fight. As a verb, it means to pick a mini-fight over something that doesn't really matter. \"Let's not quibble over price,\" people will say, usually when they plan to gouge you."}, {"id": 274, "word": "sage", "list_definition": "a mentor in spiritual and philosophical topics", "verbose_definition": "Use the word sage for someone or something wise and judicious. Thanks to the sage advice of your friend, you didn't write your teacher an angry e-mail!"}, {"id": 275, "word": "striate", "list_definition": "marked with stripes", "verbose_definition": "If a field is plowed into furrows, it's striated — or, technically, it's marked with striae, which are stripes or grooves."}, {"id": 276, "word": "veracious", "list_definition": "habitually speaking the truth", "verbose_definition": "Someone who is veracious speaks the truth — like your brutally honest friend who always lets you know what she thinks about your outfits, your hairstyle, your lasagna recipe, and your taste in movies."}, {"id": 277, "word": "precipitate", "list_definition": "bring about abruptly", "verbose_definition": "Precipitate usually means \"bringing something on\" or \"making it happen\" — and not always in a good way. An unpopular verdict might \"precipitate violence\" or one false step at the Grand Canyon could precipitate you down into the gorge."}, {"id": 278, "word": "quiescent", "list_definition": "being quiet or still or inactive", "verbose_definition": "The adjective quiescent means \"being quiet and still,\" like the quiescent moments lying in a hammock on a beautiful summer Sunday."}, {"id": 279, "word": "salubrious", "list_definition": "promoting health", "verbose_definition": "Salubrious is a fancy way to describe something that’s good for you or is generally favorable to mind or body, but it need not be limited to describing healthy foods or liquids."}, {"id": 280, "word": "strut", "list_definition": "walk in a proud, confident way", "verbose_definition": "When you strut, you walk with a proud swagger that has a little arrogance thrown in, like the prance of a running back who has just flown past the 250-pound linebackers and planted the ball in the end zone."}, {"id": 281, "word": "verbose", "list_definition": "using or containing too many words", "verbose_definition": "If you're verbose, you use far more words than you need to. A verbose book report goes on and on and is packed with long, complicated words that aren't at all necessary."}, {"id": 282, "word": "precursor", "list_definition": "something indicating the approach of something or someone", "verbose_definition": "You've heard the old saying \"Pride comes before the fall?\" Well, you could just as easily say pride is a precursor to the fall. A precursor is something that happens before something else."}, {"id": 283, "word": "rarefied", "list_definition": "of high moral or intellectual value", "verbose_definition": "Use the adjective rarefied to describe things that are so stylish, smart, or moral that they seem elevated above the ordinary, like the rarefied conversation of brilliant scholars."}, {"id": 284, "word": "sanction", "list_definition": "official permission or approval", "verbose_definition": "Sanction has two nearly opposite meanings: to sanction can be to approve of something, but it can also mean to punish, or speak harshly to. Likewise, a sanction can be a punishment or approval. Very confusing — the person who invented this word should be publicly sanctioned!"}, {"id": 285, "word": "subpoena", "list_definition": "a writ issued to compel the attendance of a witness", "verbose_definition": "A subpoena is a document that requires its recipient to appear in court as a witness. If you receive a subpoena, it doesn't mean you've done anything wrong; it just means you may have information that's needed by the court."}, {"id": 286, "word": "viable", "list_definition": "capable of life or normal growth and development", "verbose_definition": "When something is viable, it has the ability to grow or function properly. A viable seed can develop into a plant, while a viable company has the resources to succeed."}, {"id": 287, "word": "presumptuous", "list_definition": "going beyond what is appropriate, permitted, or courteous", "verbose_definition": "When someone takes liberties, doing things too boldly, you can describe them with the adjective presumptuous."}, {"id": 288, "word": "recalcitrant", "list_definition": "stubbornly resistant to authority or control", "verbose_definition": "If someone is so pig-headed that he won't budge on an issue, call him recalcitrant. Not that it will make a difference..."}, {"id": 289, "word": "satiate", "list_definition": "fill to satisfaction", "verbose_definition": "If you just can't get enough popcorn, even the jumbo tub at the movie theater may not be enough to satiate, or satisfy, your desire."}, {"id": 290, "word": "subside", "list_definition": "wear off or die down", "verbose_definition": "To subside is to die down or become less violent, like rough ocean waves after a storm has passed (or your seasickness, if you happened to be sailing on that ocean)."}, {"id": 291, "word": "viscous", "list_definition": "having a relatively high resistance to flow", "verbose_definition": "Viscous means sticky, gluey and syrupy. So if something is viscous, you usually don't want to stick your fingers in it — that goes for boogers and maple syrup alike."}, {"id": 292, "word": "prevaricate", "list_definition": "be deliberately ambiguous or unclear", "verbose_definition": "When you prevaricate, you lie or mislead. Now, go ahead and tell me whether you already knew that meaning, and don’t prevaricate about it — give me the story straight!"}, {"id": 293, "word": "recant", "list_definition": "formally reject or disavow a formerly held belief", "verbose_definition": "If you're someone who speaks before you think, you may need to recant, or take back, that overly honest assessment of your friend's new haircut."}, {"id": 294, "word": "saturate", "list_definition": "infuse or fill completely", "verbose_definition": "The verb saturate means to cause something to be fully soaked to the point where it can't take on anything else. A heavy rainstorm can saturate the ground, leaving puddles on the lawn because no more water can be absorbed."}, {"id": 295, "word": "substantiate", "list_definition": "establish or strengthen as with new evidence or facts", "verbose_definition": "To substantiate is to give support to a claim. We’d really like to believe in the Tooth Fairy; however, more evidence is needed to substantiate her existence (besides that quarter in your pocket)."}, {"id": 296, "word": "vituperative", "list_definition": "marked by harshly abusive criticism", "verbose_definition": "Use the adjective vituperative to describe criticism that's so sharp it hurts. A vituperative review of a movie would make the director bitter for months."}, {"id": 297, "word": "pristine", "list_definition": "immaculately clean and unused", "verbose_definition": "If something is pristine it's immaculately clean or has never been used. So please check your shoes before walking on a pristine white carpet."}, {"id": 298, "word": "recluse", "list_definition": "one who lives in solitude", "verbose_definition": "A recluse lives alone, works alone, eats alone, and generally stays away from other people. Anti-social old hermits are recluses, as are a lot of students during exam time."}, {"id": 299, "word": "savor", "list_definition": "a particular taste or smell, especially an appealing one", "verbose_definition": "Whether it’s a feeling of joy or a piece of pecan pie — when you savor something, you enjoy it to the fullest."}, {"id": 300, "word": "supersede", "list_definition": "take the place or move into the position of", "verbose_definition": "If you click on the link after this description, a new screen will supersede, or replace, this one. A longer description will supplant, or supersede, by replacing this brief one."}, {"id": 301, "word": "volatile", "list_definition": "liable to lead to sudden change or violence", "verbose_definition": "Watch out when a situation becomes volatile — it is likely to change for the worse suddenly. If you and your best friend have a volatile relationship, you frequently fight and make up."}, {"id": 302, "word": "probity", "list_definition": "complete and confirmed integrity", "verbose_definition": "Though probity sounds like what you might do with a sharp stick, it actually means being morally and ethically above reproach, or having integrity."}, {"id": 303, "word": "recondite", "list_definition": "difficult to understand", "verbose_definition": "It's rather difficult to penetrate the meaning of recondite. Fitting, because it's an adjective that basically means hard for the average mind to understand."}, {"id": 304, "word": "secrete", "list_definition": "generate and separate from cells or bodily fluids", "verbose_definition": "Secrete is all about secrets. It means both \"to hide\" and \"to release.\" When you squeeze a lemon, it secretes juice. When you stuff your money in a mattress, you secrete it there."}, {"id": 305, "word": "supposition", "list_definition": "the cognitive process of conjecturing", "verbose_definition": "A supposition is a guess or a hypothesis. Your supposition that your kids will automatically wash their hands before dinner is probably false. You'd best remind them to do it or risk dirty hands at dinner."}, {"id": 306, "word": "unwarranted", "list_definition": "incapable of being justified or explained", "verbose_definition": "When something is unwarranted it's not called-for under the given circumstances. For example, debating the merits of someone's talent is one thing, but calling them stupid is unwarranted."}, {"id": 307, "word": "problematic", "list_definition": "making great mental demands", "verbose_definition": "Something problematic poses a problem or causes difficulties. Your ambitions to become the next great leader of Spain are great, but your inability to speak Spanish might prove problematic."}, {"id": 308, "word": "refractory", "list_definition": "stubbornly resistant to authority or control", "verbose_definition": "Imagine yourself pulling a dog who doesn't want to walk. The dog is refractory, or stubbornly resisting your authority."}, {"id": 309, "word": "shard", "list_definition": "a broken piece of a brittle artifact", "verbose_definition": "If you break a mirror, the thin sharp pieces you want to avoid are shards. A shard is simply a broken piece of metal, glass, stone, or pottery with sharp edges."}, {"id": 310, "word": "tacit", "list_definition": "implied by or inferred from actions or statements", "verbose_definition": "Something tacit is implied or understood without question. Holding hands might be a tacit acknowledgment that a boy and girl are dating."}, {"id": 311, "word": "wary", "list_definition": "marked by keen caution and watchful prudence", "verbose_definition": "Describe yourself as wary if you don't quite trust someone or something and want to proceed with caution. Be wary of risky things like wild mushrooms and Internet deals!"}, {"id": 312, "word": "prodigal", "list_definition": "recklessly wasteful", "verbose_definition": "Use the adjective prodigal to describe someone who spends too much money, or something very wasteful. Your prodigal spending on fancy coffee drinks might leave you with no money to buy lunch."}, {"id": 313, "word": "refute", "list_definition": "overthrow by argument, evidence, or proof", "verbose_definition": "The verb refute is to prove that something is wrong. When the kids you're babysitting swear they brushed their teeth, you can refute their claim by presenting the dry toothbrushes."}, {"id": 314, "word": "skeptic", "list_definition": "someone who habitually doubts accepted beliefs", "verbose_definition": "A skeptic is a person who doesn't believe something is true unless they see evidence. As a skeptic, you refuse to believe your sister saw a ghost — after all, she can't prove it."}, {"id": 315, "word": "tangential", "list_definition": "of superficial relevance if any", "verbose_definition": "Tangential describes something that's not part of the whole. If you make a comment that is tangential to the story you're telling, it's a digression. The story could still be understood without it."}, {"id": 316, "word": "welter", "list_definition": "a confused multitude of things", "verbose_definition": "Use the noun welter to describe an enormous, messy pile, like the jumble of papers, coffee mugs, pens, and food wrappers on the desk of the messiest person in the office."}, {"id": 317, "word": "profound", "list_definition": "situated at or extending to great depth", "verbose_definition": "When you need a word that's deeper than \"deep,\" consider profound. A philosopher is likely to make many profound pronouncements."}, {"id": 318, "word": "relegate", "list_definition": "assign to a lower position", "verbose_definition": "Relegate means \"to assign to a lower position.\" If the quarterback of the football team stops making decent throws, he might be relegated to the position of benchwarmer."}, {"id": 319, "word": "solicitous", "list_definition": "full of anxiety and concern", "verbose_definition": "When you hear the word solicitous, think of your mom — attentive, caring, and concerned. It's nice when your waiter gives you good service, but if he or she is solicitous, the hovering might annoy you."}, {"id": 320, "word": "tenuous", "list_definition": "very thin in gauge or diameter", "verbose_definition": "If something is tenuous it's thin, either literally or metaphorically. If you try to learn a complicated mathematical concept by cramming for 45 minutes, you will have a tenuous grasp of that concept, at best."}, {"id": 321, "word": "whimsical", "list_definition": "determined by chance or impulse rather than by necessity", "verbose_definition": "Whimsical means full of or characterized by whims, which are odd ideas that usually occur to you very suddenly. If you decide at the last minute to fly to Europe, you could say you went there on a whim."}, {"id": 322, "word": "prohibitive", "list_definition": "tending to discourage, especially of prices", "verbose_definition": "That expensive Ferrari in the showroom? You may want it, but its price is prohibitive — which means the price is discouragingly high and likely to deter you from buying."}, {"id": 323, "word": "reproach", "list_definition": "express criticism towards", "verbose_definition": "Reproach means to mildly criticize. If you show poor manners at your grandmother's dinner table, she will reproach you."}, {"id": 324, "word": "soporific", "list_definition": "inducing sleep", "verbose_definition": "Something that is soporific is sleep-inducing. Certain medicines, but also extreme coziness, can have a soporific effect."}, {"id": 325, "word": "tirade", "list_definition": "a speech of violent denunciation", "verbose_definition": "A tirade is a speech, usually consisting of a long string of violent, emotionally charged words. Borrow and lose your roommate’s clothes one too many times, and you can bet you’ll be treated to a heated tirade."}, {"id": 326, "word": "zealot", "list_definition": "a fervent and even militant proponent of something", "verbose_definition": "The hamburger zealot was so fanatical about his burgers that he camped outside his favorite fast-food joint for hours every morning, waiting for it to open. And he would never put mustard on them, only ketchup."}, {"id": 327, "word": "proliferate", "list_definition": "grow rapidly", "verbose_definition": "When something proliferates, it's growing, spreading or multiplying really quickly. Bunny rabbits have a habit of proliferating, as do dandelions in untended gardens and funny YouTube videos on the internet."}, {"id": 328, "word": "reprobate", "list_definition": "a person without moral scruples", "verbose_definition": "There's no way around it, a reprobate is a bad egg. The black sheep of the family, missing a moral compass — a reprobate's been called everything from a deviant to an evildoer to a scoundrel."}, {"id": 329, "word": "specious", "list_definition": "plausible but false", "verbose_definition": "Use specious to describe an argument that seems to be good, correct, or logical, but is not so. We live on the earth, therefore the earth must be the center of the universe has been proven to be a specious theory of the solar system."}, {"id": 330, "word": "torpor", "list_definition": "a state of motor and mental inactivity", "verbose_definition": "Torpor is a state of mental and physical inactivity. \"After a huge Thanksgiving meal, my family members fall into a torpor; no one can even pick up the TV remote.\""}, {"id": 331, "word": "propensity", "list_definition": "a natural inclination", "verbose_definition": "A propensity is a natural tendency to behave in a certain way. We all have propensities — things we tend to do. Dogs have a propensity to bark, and many people have a propensity for getting annoyed by it."}, {"id": 332, "word": "repudiate", "list_definition": "refuse to acknowledge, ratify, or recognize as valid", "verbose_definition": "To repudiate something is to reject it, or to refuse to accept or support it. If you grow up religious, but repudiate all organized religion as an adult, you might start spending holidays at the movies, or just going to work."}, {"id": 333, "word": "spectrum", "list_definition": "a broad range of related objects, values, or qualities", "verbose_definition": "A spectrum is a broad range of similar things or qualities, like the wide spectrum of political beliefs in this country, ranging anywhere from super conservative to über-liberal and everything in between."}, {"id": 334, "word": "tortuous", "list_definition": "marked by repeated turns and bends", "verbose_definition": "Tortuous means twisting or complicated. \"James Bond drove up a mountain road that was tortuous in its twists and turns. He had to stop the evil madman's plan for world domination, a plan so tortuous that even 007 himself could not understand it.\""}]